docs/benchmarks/20260512_220000_path_b_idempotency/path_b_ceiling_k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /script.js
        output: -

     scenarios: (100.00%) 1 scenario, 30000 max VUs, 3m55s max duration (incl. graceful stop):
              * ceiling_idem: Up to 20000.00 iterations/s for 3m25s over 11 stages (maxVUs: 5000-30000, gracefulStop: 30s)


running (0m00.6s), 00002/05000 VUs, 290 complete and 0 interrupted iterations
ceiling_idem   [   0% ] 00002/05000 VUs  0m00.6s/3m25s  00581.16 iters/s

running (0m01.6s), 00001/05000 VUs, 945 complete and 0 interrupted iterations
ceiling_idem   [   1% ] 00001/05000 VUs  0m01.6s/3m25s  00730.72 iters/s

running (0m02.6s), 00001/05000 VUs, 1751 complete and 0 interrupted iterations
ceiling_idem   [   1% ] 00001/05000 VUs  0m02.6s/3m25s  00880.77 iters/s

running (0m03.6s), 00003/05000 VUs, 2707 complete and 0 interrupted iterations
ceiling_idem   [   2% ] 00003/05000 VUs  0m03.6s/3m25s  01031.09 iters/s

running (0m04.6s), 00002/05000 VUs, 3811 complete and 0 interrupted iterations
ceiling_idem   [   2% ] 00002/05000 VUs  0m04.6s/3m25s  01180.70 iters/s

running (0m05.6s), 00002/05000 VUs, 5067 complete and 0 interrupted iterations
ceiling_idem   [   3% ] 00002/05000 VUs  0m05.6s/3m25s  01330.73 iters/s

running (0m06.6s), 00000/05000 VUs, 6475 complete and 0 interrupted iterations
ceiling_idem   [   3% ] 00000/05000 VUs  0m06.6s/3m25s  01480.76 iters/s

running (0m07.6s), 00001/05000 VUs, 8030 complete and 0 interrupted iterations
ceiling_idem   [   4% ] 00001/05000 VUs  0m07.6s/3m25s  01630.78 iters/s

running (0m08.6s), 00004/05000 VUs, 9734 complete and 0 interrupted iterations
ceiling_idem   [   4% ] 00004/05000 VUs  0m08.6s/3m25s  01780.88 iters/s

running (0m09.6s), 00004/05000 VUs, 11590 complete and 0 interrupted iterations
ceiling_idem   [   5% ] 00004/05000 VUs  0m09.6s/3m25s  01930.89 iters/s

running (0m10.6s), 00001/05000 VUs, 13575 complete and 0 interrupted iterations
ceiling_idem   [   5% ] 00001/05000 VUs  0m10.6s/3m25s  02000.00 iters/s

running (0m11.6s), 00002/05000 VUs, 15574 complete and 0 interrupted iterations
ceiling_idem   [   6% ] 00002/05000 VUs  0m11.6s/3m25s  02000.00 iters/s

running (0m12.6s), 00000/05000 VUs, 17575 complete and 0 interrupted iterations
ceiling_idem   [   6% ] 00000/05000 VUs  0m12.6s/3m25s  02000.00 iters/s

running (0m13.6s), 00001/05000 VUs, 19575 complete and 0 interrupted iterations
ceiling_idem   [   7% ] 00001/05000 VUs  0m13.6s/3m25s  02000.00 iters/s

running (0m14.6s), 00000/05000 VUs, 21574 complete and 0 interrupted iterations
ceiling_idem   [   7% ] 00000/05000 VUs  0m14.6s/3m25s  02000.00 iters/s

running (0m15.6s), 00002/05000 VUs, 23576 complete and 0 interrupted iterations
ceiling_idem   [   8% ] 00002/05000 VUs  0m15.6s/3m25s  02000.00 iters/s

running (0m16.6s), 00002/05000 VUs, 25574 complete and 0 interrupted iterations
ceiling_idem   [   8% ] 00002/05000 VUs  0m16.6s/3m25s  02000.00 iters/s

running (0m17.6s), 00004/05000 VUs, 27572 complete and 0 interrupted iterations
ceiling_idem   [   9% ] 00004/05000 VUs  0m17.6s/3m25s  02000.00 iters/s

running (0m18.6s), 00005/05000 VUs, 29573 complete and 0 interrupted iterations
ceiling_idem   [   9% ] 00005/05000 VUs  0m18.6s/3m25s  02000.00 iters/s

running (0m19.6s), 00005/05000 VUs, 31571 complete and 0 interrupted iterations
ceiling_idem   [  10% ] 00004/05000 VUs  0m19.6s/3m25s  02000.00 iters/s

running (0m20.6s), 00000/05000 VUs, 33575 complete and 0 interrupted iterations
ceiling_idem   [  10% ] 00001/05000 VUs  0m20.6s/3m25s  02000.00 iters/s

running (0m21.6s), 00004/05000 VUs, 35574 complete and 0 interrupted iterations
ceiling_idem   [  11% ] 00004/05000 VUs  0m21.6s/3m25s  02000.00 iters/s

running (0m22.6s), 00004/05000 VUs, 37572 complete and 0 interrupted iterations
ceiling_idem   [  11% ] 00004/05000 VUs  0m22.6s/3m25s  02000.00 iters/s

running (0m23.6s), 00000/05000 VUs, 39576 complete and 0 interrupted iterations
ceiling_idem   [  11% ] 00000/05000 VUs  0m23.6s/3m25s  02000.00 iters/s

running (0m24.6s), 00002/05000 VUs, 41576 complete and 0 interrupted iterations
ceiling_idem   [  12% ] 00002/05000 VUs  0m24.6s/3m25s  02000.00 iters/s

running (0m25.6s), 00000/05000 VUs, 43574 complete and 0 interrupted iterations
ceiling_idem   [  12% ] 00000/05000 VUs  0m25.6s/3m25s  02000.00 iters/s

running (0m26.6s), 00001/05000 VUs, 45575 complete and 0 interrupted iterations
ceiling_idem   [  13% ] 00001/05000 VUs  0m26.6s/3m25s  02000.00 iters/s

running (0m27.6s), 00000/05000 VUs, 47574 complete and 0 interrupted iterations
ceiling_idem   [  13% ] 00000/05000 VUs  0m27.6s/3m25s  02000.00 iters/s

running (0m28.6s), 00001/05000 VUs, 49576 complete and 0 interrupted iterations
ceiling_idem   [  14% ] 00001/05000 VUs  0m28.6s/3m25s  02000.00 iters/s

running (0m29.6s), 00000/05000 VUs, 51575 complete and 0 interrupted iterations
ceiling_idem   [  14% ] 00000/05000 VUs  0m29.6s/3m25s  02000.00 iters/s

running (0m30.6s), 00005/05000 VUs, 53571 complete and 0 interrupted iterations
ceiling_idem   [  15% ] 00005/05000 VUs  0m30.6s/3m25s  02000.00 iters/s

running (0m31.6s), 00002/05000 VUs, 55575 complete and 0 interrupted iterations
ceiling_idem   [  15% ] 00002/05000 VUs  0m31.6s/3m25s  02000.00 iters/s

running (0m32.6s), 00000/05000 VUs, 57576 complete and 0 interrupted iterations
ceiling_idem   [  16% ] 00000/05000 VUs  0m32.6s/3m25s  02000.00 iters/s

running (0m33.6s), 00000/05000 VUs, 59574 complete and 0 interrupted iterations
ceiling_idem   [  16% ] 00000/05000 VUs  0m33.6s/3m25s  02000.00 iters/s

running (0m34.6s), 00004/05000 VUs, 61572 complete and 0 interrupted iterations
ceiling_idem   [  17% ] 00004/05000 VUs  0m34.6s/3m25s  02000.00 iters/s

running (0m35.6s), 00004/05000 VUs, 63572 complete and 0 interrupted iterations
ceiling_idem   [  17% ] 00004/05000 VUs  0m35.6s/3m25s  02000.00 iters/s

running (0m36.6s), 00003/05000 VUs, 65573 complete and 0 interrupted iterations
ceiling_idem   [  18% ] 00003/05000 VUs  0m36.6s/3m25s  02000.00 iters/s

running (0m37.6s), 00021/05000 VUs, 67555 complete and 0 interrupted iterations
ceiling_idem   [  18% ] 00021/05000 VUs  0m37.6s/3m25s  02000.00 iters/s

running (0m38.6s), 00001/05000 VUs, 69575 complete and 0 interrupted iterations
ceiling_idem   [  19% ] 00001/05000 VUs  0m38.6s/3m25s  02000.00 iters/s

running (0m39.6s), 00000/05000 VUs, 71576 complete and 0 interrupted iterations
ceiling_idem   [  19% ] 00000/05000 VUs  0m39.6s/3m25s  02000.00 iters/s

running (0m40.6s), 00001/05000 VUs, 73619 complete and 0 interrupted iterations
ceiling_idem   [  20% ] 00001/05000 VUs  0m40.6s/3m25s  02161.55 iters/s

running (0m41.6s), 00000/05000 VUs, 75928 complete and 0 interrupted iterations
ceiling_idem   [  20% ] 00000/05000 VUs  0m41.6s/3m25s  02461.12 iters/s

running (0m42.6s), 00000/05000 VUs, 78541 complete and 0 interrupted iterations
ceiling_idem   [  21% ] 00000/05000 VUs  0m42.6s/3m25s  02761.32 iters/s

running (0m43.6s), 00001/05000 VUs, 81453 complete and 0 interrupted iterations
ceiling_idem   [  21% ] 00001/05000 VUs  0m43.6s/3m25s  03061.49 iters/s

running (0m44.6s), 00001/05000 VUs, 84665 complete and 0 interrupted iterations
ceiling_idem   [  22% ] 00001/05000 VUs  0m44.6s/3m25s  03361.53 iters/s

running (0m45.6s), 00001/05000 VUs, 88176 complete and 0 interrupted iterations
ceiling_idem   [  22% ] 00001/05000 VUs  0m45.6s/3m25s  03661.49 iters/s

running (0m46.6s), 00014/05000 VUs, 91866 complete and 0 interrupted iterations
ceiling_idem   [  23% ] 00014/05000 VUs  0m46.6s/3m25s  03954.71 iters/s

running (0m47.6s), 00006/05000 VUs, 96098 complete and 0 interrupted iterations
ceiling_idem   [  23% ] 00006/05000 VUs  0m47.6s/3m25s  04261.78 iters/s

running (0m48.6s), 00000/05000 VUs, 100511 complete and 0 interrupted iterations
ceiling_idem   [  24% ] 00000/05000 VUs  0m48.6s/3m25s  04561.44 iters/s

running (0m49.6s), 00000/05000 VUs, 105223 complete and 0 interrupted iterations
ceiling_idem   [  24% ] 00001/05000 VUs  0m49.6s/3m25s  04861.66 iters/s

running (0m50.6s), 00001/05000 VUs, 110190 complete and 0 interrupted iterations
ceiling_idem   [  25% ] 00001/05000 VUs  0m50.6s/3m25s  05000.00 iters/s

running (0m51.6s), 00002/05000 VUs, 115189 complete and 0 interrupted iterations
ceiling_idem   [  25% ] 00002/05000 VUs  0m51.6s/3m25s  05000.00 iters/s

running (0m52.6s), 00003/05000 VUs, 120188 complete and 0 interrupted iterations
ceiling_idem   [  26% ] 00003/05000 VUs  0m52.6s/3m25s  05000.00 iters/s

running (0m53.6s), 00005/05000 VUs, 125186 complete and 0 interrupted iterations
ceiling_idem   [  26% ] 00005/05000 VUs  0m53.6s/3m25s  05000.00 iters/s

running (0m54.6s), 00004/05000 VUs, 130186 complete and 0 interrupted iterations
ceiling_idem   [  27% ] 00004/05000 VUs  0m54.6s/3m25s  05000.00 iters/s

running (0m55.6s), 00001/05000 VUs, 135193 complete and 0 interrupted iterations
ceiling_idem   [  27% ] 00001/05000 VUs  0m55.6s/3m25s  05000.00 iters/s

running (0m56.6s), 00001/05000 VUs, 140193 complete and 0 interrupted iterations
ceiling_idem   [  28% ] 00001/05000 VUs  0m56.6s/3m25s  05000.00 iters/s

running (0m57.6s), 00001/05000 VUs, 145189 complete and 0 interrupted iterations
ceiling_idem   [  28% ] 00001/05000 VUs  0m57.6s/3m25s  05000.00 iters/s

running (0m58.6s), 00006/05000 VUs, 150185 complete and 0 interrupted iterations
ceiling_idem   [  29% ] 00006/05000 VUs  0m58.6s/3m25s  05000.00 iters/s

running (0m59.6s), 00004/05000 VUs, 155186 complete and 0 interrupted iterations
ceiling_idem   [  29% ] 00004/05000 VUs  0m59.6s/3m25s  05000.00 iters/s

running (1m00.6s), 00005/05000 VUs, 160190 complete and 0 interrupted iterations
ceiling_idem   [  30% ] 00005/05000 VUs  1m00.6s/3m25s  05000.00 iters/s

running (1m01.6s), 00010/05000 VUs, 165181 complete and 0 interrupted iterations
ceiling_idem   [  30% ] 00010/05000 VUs  1m01.6s/3m25s  05000.00 iters/s

running (1m02.6s), 00001/05000 VUs, 170193 complete and 0 interrupted iterations
ceiling_idem   [  31% ] 00001/05000 VUs  1m02.6s/3m25s  05000.00 iters/s

running (1m03.6s), 00003/05000 VUs, 175188 complete and 0 interrupted iterations
ceiling_idem   [  31% ] 00003/05000 VUs  1m03.6s/3m25s  05000.00 iters/s

running (1m04.6s), 00005/05000 VUs, 180190 complete and 0 interrupted iterations
ceiling_idem   [  31% ] 00005/05000 VUs  1m04.6s/3m25s  05000.00 iters/s

running (1m05.6s), 00002/05000 VUs, 185189 complete and 0 interrupted iterations
ceiling_idem   [  32% ] 00002/05000 VUs  1m05.6s/3m25s  05000.00 iters/s

running (1m06.6s), 00071/05000 VUs, 190149 complete and 0 interrupted iterations
ceiling_idem   [  32% ] 00071/05000 VUs  1m06.6s/3m25s  05000.00 iters/s

running (1m07.6s), 00000/05000 VUs, 195190 complete and 0 interrupted iterations
ceiling_idem   [  33% ] 00000/05000 VUs  1m07.6s/3m25s  05000.00 iters/s

running (1m08.6s), 00001/05000 VUs, 200193 complete and 0 interrupted iterations
ceiling_idem   [  33% ] 00002/05000 VUs  1m08.6s/3m25s  05000.00 iters/s

running (1m09.6s), 00005/05000 VUs, 205185 complete and 0 interrupted iterations
ceiling_idem   [  34% ] 00004/05000 VUs  1m09.6s/3m25s  05000.00 iters/s

running (1m10.6s), 00002/05000 VUs, 210191 complete and 0 interrupted iterations
ceiling_idem   [  34% ] 00002/05000 VUs  1m10.6s/3m25s  05000.00 iters/s

running (1m11.6s), 00005/05000 VUs, 215185 complete and 0 interrupted iterations
ceiling_idem   [  35% ] 00005/05000 VUs  1m11.6s/3m25s  05000.00 iters/s

running (1m12.6s), 00002/05000 VUs, 220189 complete and 0 interrupted iterations
ceiling_idem   [  35% ] 00002/05000 VUs  1m12.6s/3m25s  05000.00 iters/s

running (1m13.6s), 00001/05000 VUs, 225190 complete and 0 interrupted iterations
ceiling_idem   [  36% ] 00001/05000 VUs  1m13.6s/3m25s  05000.00 iters/s

running (1m14.6s), 00001/05000 VUs, 230191 complete and 0 interrupted iterations
ceiling_idem   [  36% ] 00001/05000 VUs  1m14.6s/3m25s  05000.00 iters/s

running (1m15.6s), 00003/05000 VUs, 235188 complete and 0 interrupted iterations
ceiling_idem   [  37% ] 00002/05000 VUs  1m15.6s/3m25s  05000.00 iters/s

running (1m16.6s), 00023/05000 VUs, 240170 complete and 0 interrupted iterations
ceiling_idem   [  37% ] 00023/05000 VUs  1m16.6s/3m25s  05000.00 iters/s

running (1m17.6s), 00003/05000 VUs, 245187 complete and 0 interrupted iterations
ceiling_idem   [  38% ] 00003/05000 VUs  1m17.6s/3m25s  05000.00 iters/s

running (1m18.6s), 00027/05000 VUs, 250164 complete and 0 interrupted iterations
ceiling_idem   [  38% ] 00027/05000 VUs  1m18.6s/3m25s  05000.00 iters/s

running (1m19.6s), 00001/05000 VUs, 255189 complete and 0 interrupted iterations
ceiling_idem   [  39% ] 00001/05000 VUs  1m19.6s/3m25s  05000.00 iters/s

running (1m20.6s), 00001/05000 VUs, 260263 complete and 0 interrupted iterations
ceiling_idem   [  39% ] 00001/05000 VUs  1m20.6s/3m25s  05269.20 iters/s

running (1m21.6s), 00002/05000 VUs, 265785 complete and 0 interrupted iterations
ceiling_idem   [  40% ] 00002/05000 VUs  1m21.6s/3m25s  05769.54 iters/s

running (1m22.6s), 00007/05000 VUs, 271800 complete and 0 interrupted iterations
ceiling_idem   [  40% ] 00007/05000 VUs  1m22.6s/3m25s  06269.55 iters/s

running (1m23.6s), 00002/05000 VUs, 278320 complete and 0 interrupted iterations
ceiling_idem   [  41% ] 00002/05000 VUs  1m23.6s/3m25s  06769.20 iters/s

running (1m24.6s), 00004/05000 VUs, 285336 complete and 0 interrupted iterations
ceiling_idem   [  41% ] 00004/05000 VUs  1m24.6s/3m25s  07269.13 iters/s

running (1m25.6s), 00002/05000 VUs, 292859 complete and 0 interrupted iterations
ceiling_idem   [  42% ] 00002/05000 VUs  1m25.6s/3m25s  07769.22 iters/s

running (1m26.6s), 00092/05000 VUs, 300773 complete and 0 interrupted iterations
ceiling_idem   [  42% ] 00092/05000 VUs  1m26.6s/3m25s  08269.18 iters/s

running (1m27.6s), 00011/05000 VUs, 309387 complete and 0 interrupted iterations
ceiling_idem   [  43% ] 00011/05000 VUs  1m27.6s/3m25s  08769.16 iters/s

running (1m28.6s), 00005/05000 VUs, 318413 complete and 0 interrupted iterations
ceiling_idem   [  43% ] 00005/05000 VUs  1m28.6s/3m25s  09269.22 iters/s

running (1m29.6s), 00004/05000 VUs, 327931 complete and 0 interrupted iterations
ceiling_idem   [  44% ] 00004/05000 VUs  1m29.6s/3m25s  09769.06 iters/s

running (1m30.6s), 00011/05000 VUs, 337871 complete and 0 interrupted iterations
ceiling_idem   [  44% ] 00011/05000 VUs  1m30.6s/3m25s  10000.00 iters/s

running (1m31.6s), 00006/05000 VUs, 347844 complete and 0 interrupted iterations
ceiling_idem   [  45% ] 00006/05000 VUs  1m31.6s/3m25s  10000.00 iters/s

running (1m32.6s), 00011/05000 VUs, 357880 complete and 0 interrupted iterations
ceiling_idem   [  45% ] 00011/05000 VUs  1m32.6s/3m25s  10000.00 iters/s

running (1m33.6s), 00003/05000 VUs, 367879 complete and 0 interrupted iterations
ceiling_idem   [  46% ] 00003/05000 VUs  1m33.6s/3m25s  10000.00 iters/s

running (1m34.6s), 00007/05000 VUs, 377875 complete and 0 interrupted iterations
ceiling_idem   [  46% ] 00007/05000 VUs  1m34.6s/3m25s  10000.00 iters/s

running (1m35.6s), 00005/05000 VUs, 387877 complete and 0 interrupted iterations
ceiling_idem   [  47% ] 00005/05000 VUs  1m35.6s/3m25s  10000.00 iters/s

running (1m36.6s), 00012/05000 VUs, 397870 complete and 0 interrupted iterations
ceiling_idem   [  47% ] 00012/05000 VUs  1m36.6s/3m25s  10000.00 iters/s

running (1m37.6s), 00029/05000 VUs, 407863 complete and 0 interrupted iterations
ceiling_idem   [  48% ] 00030/05000 VUs  1m37.6s/3m25s  10000.00 iters/s

running (1m38.6s), 00003/05000 VUs, 417879 complete and 0 interrupted iterations
ceiling_idem   [  48% ] 00003/05000 VUs  1m38.6s/3m25s  10000.00 iters/s

running (1m39.6s), 00007/05000 VUs, 427876 complete and 0 interrupted iterations
ceiling_idem   [  49% ] 00007/05000 VUs  1m39.6s/3m25s  10000.00 iters/s

running (1m40.6s), 00003/05000 VUs, 437883 complete and 0 interrupted iterations
ceiling_idem   [  49% ] 00003/05000 VUs  1m40.6s/3m25s  10000.00 iters/s

running (1m41.6s), 00003/05000 VUs, 447881 complete and 0 interrupted iterations
ceiling_idem   [  50% ] 00003/05000 VUs  1m41.6s/3m25s  10000.00 iters/s

running (1m42.6s), 00001/05000 VUs, 457882 complete and 0 interrupted iterations
ceiling_idem   [  50% ] 00001/05000 VUs  1m42.6s/3m25s  10000.00 iters/s

running (1m43.6s), 00003/05000 VUs, 467878 complete and 0 interrupted iterations
ceiling_idem   [  51% ] 00003/05000 VUs  1m43.6s/3m25s  10000.00 iters/s

running (1m44.6s), 00010/05000 VUs, 477875 complete and 0 interrupted iterations
ceiling_idem   [  51% ] 00010/05000 VUs  1m44.6s/3m25s  10000.00 iters/s

running (1m45.6s), 00004/05000 VUs, 487885 complete and 0 interrupted iterations
ceiling_idem   [  51% ] 00004/05000 VUs  1m45.6s/3m25s  10000.00 iters/s

running (1m46.6s), 00013/05000 VUs, 497870 complete and 0 interrupted iterations
ceiling_idem   [  52% ] 00013/05000 VUs  1m46.6s/3m25s  10000.00 iters/s

running (1m47.6s), 00008/05000 VUs, 507876 complete and 0 interrupted iterations
ceiling_idem   [  52% ] 00008/05000 VUs  1m47.6s/3m25s  10000.00 iters/s

running (1m48.6s), 00004/05000 VUs, 517878 complete and 0 interrupted iterations
ceiling_idem   [  53% ] 00004/05000 VUs  1m48.6s/3m25s  10000.00 iters/s

running (1m49.6s), 00003/05000 VUs, 527880 complete and 0 interrupted iterations
ceiling_idem   [  53% ] 00003/05000 VUs  1m49.6s/3m25s  10000.00 iters/s

running (1m50.6s), 00003/05000 VUs, 537880 complete and 0 interrupted iterations
ceiling_idem   [  54% ] 00003/05000 VUs  1m50.6s/3m25s  10000.00 iters/s

running (1m51.6s), 00001/05000 VUs, 547881 complete and 0 interrupted iterations
ceiling_idem   [  54% ] 00001/05000 VUs  1m51.6s/3m25s  10000.00 iters/s

running (1m52.6s), 00050/05000 VUs, 557841 complete and 0 interrupted iterations
ceiling_idem   [  55% ] 00050/05000 VUs  1m52.6s/3m25s  10000.00 iters/s

running (1m53.6s), 00004/05000 VUs, 567879 complete and 0 interrupted iterations
ceiling_idem   [  55% ] 00004/05000 VUs  1m53.6s/3m25s  10000.00 iters/s

running (1m54.6s), 00000/05000 VUs, 577883 complete and 0 interrupted iterations
ceiling_idem   [  56% ] 00000/05000 VUs  1m54.6s/3m25s  10000.00 iters/s

running (1m55.6s), 00005/05000 VUs, 587877 complete and 0 interrupted iterations
ceiling_idem   [  56% ] 00005/05000 VUs  1m55.6s/3m25s  10000.00 iters/s

running (1m56.6s), 00035/05000 VUs, 597856 complete and 0 interrupted iterations
ceiling_idem   [  57% ] 00035/05000 VUs  1m56.6s/3m25s  10000.00 iters/s

running (1m57.6s), 00000/05000 VUs, 607880 complete and 0 interrupted iterations
ceiling_idem   [  57% ] 00000/05000 VUs  1m57.6s/3m25s  10000.00 iters/s

running (1m58.6s), 00003/05000 VUs, 617882 complete and 0 interrupted iterations
ceiling_idem   [  58% ] 00003/05000 VUs  1m58.6s/3m25s  10000.00 iters/s

running (1m59.6s), 00008/05000 VUs, 627875 complete and 0 interrupted iterations
ceiling_idem   [  58% ] 00008/05000 VUs  1m59.6s/3m25s  10000.00 iters/s

running (2m00.6s), 00001/05000 VUs, 637950 complete and 0 interrupted iterations
ceiling_idem   [  59% ] 00001/05000 VUs  2m00.6s/3m25s  10268.94 iters/s

running (2m01.6s), 00080/05000 VUs, 648397 complete and 0 interrupted iterations
ceiling_idem   [  59% ] 00080/05000 VUs  2m01.6s/3m25s  10769.36 iters/s

running (2m02.6s), 00009/05000 VUs, 659492 complete and 0 interrupted iterations
ceiling_idem   [  60% ] 00009/05000 VUs  2m02.6s/3m25s  11269.51 iters/s

running (2m03.6s), 00004/05000 VUs, 671008 complete and 0 interrupted iterations
ceiling_idem   [  60% ] 00004/05000 VUs  2m03.6s/3m25s  11769.14 iters/s

running (2m04.6s), 00009/05000 VUs, 683019 complete and 0 interrupted iterations
ceiling_idem   [  61% ] 00009/05000 VUs  2m04.6s/3m25s  12269.04 iters/s

running (2m05.6s), 00007/05000 VUs, 695545 complete and 0 interrupted iterations
ceiling_idem   [  61% ] 00007/05000 VUs  2m05.6s/3m25s  12769.27 iters/s

running (2m06.6s), 00010/05000 VUs, 708560 complete and 0 interrupted iterations
ceiling_idem   [  62% ] 00010/05000 VUs  2m06.6s/3m25s  13269.11 iters/s

running (2m07.6s), 00005/05000 VUs, 722005 complete and 0 interrupted iterations
ceiling_idem   [  62% ] 00005/05000 VUs  2m07.6s/3m25s  13766.52 iters/s

running (2m08.6s), 00006/05000 VUs, 736100 complete and 0 interrupted iterations
ceiling_idem   [  63% ] 00006/05000 VUs  2m08.6s/3m25s  14269.20 iters/s

running (2m09.6s), 00006/05000 VUs, 750622 complete and 0 interrupted iterations
ceiling_idem   [  63% ] 00006/05000 VUs  2m09.6s/3m25s  14769.30 iters/s

running (2m10.6s), 00009/05000 VUs, 765565 complete and 0 interrupted iterations
ceiling_idem   [  64% ] 00009/05000 VUs  2m10.6s/3m25s  14999.93 iters/s

running (2m11.6s), 00000/05000 VUs, 780570 complete and 0 interrupted iterations
ceiling_idem   [  64% ] 00000/05000 VUs  2m11.6s/3m25s  15000.15 iters/s

running (2m12.6s), 00009/05000 VUs, 795561 complete and 0 interrupted iterations
ceiling_idem   [  65% ] 00009/05000 VUs  2m12.6s/3m25s  15000.15 iters/s

running (2m13.6s), 00000/05000 VUs, 810568 complete and 0 interrupted iterations
ceiling_idem   [  65% ] 00000/05000 VUs  2m13.6s/3m25s  14999.93 iters/s

running (2m14.6s), 00006/05000 VUs, 825570 complete and 0 interrupted iterations
ceiling_idem   [  66% ] 00006/05000 VUs  2m14.6s/3m25s  15000.15 iters/s

running (2m15.6s), 00009/05000 VUs, 840566 complete and 0 interrupted iterations
ceiling_idem   [  66% ] 00009/05000 VUs  2m15.6s/3m25s  14999.93 iters/s

running (2m16.6s), 00028/05000 VUs, 855573 complete and 0 interrupted iterations
ceiling_idem   [  67% ] 00028/05000 VUs  2m16.6s/3m25s  14999.93 iters/s

running (2m17.6s), 00013/05000 VUs, 870561 complete and 0 interrupted iterations
ceiling_idem   [  67% ] 00013/05000 VUs  2m17.6s/3m25s  14999.93 iters/s

running (2m18.6s), 00009/05000 VUs, 885564 complete and 0 interrupted iterations
ceiling_idem   [  68% ] 00010/05000 VUs  2m18.6s/3m25s  14999.93 iters/s

running (2m19.6s), 00000/05000 VUs, 900570 complete and 0 interrupted iterations
ceiling_idem   [  68% ] 00000/05000 VUs  2m19.6s/3m25s  15000.15 iters/s

running (2m20.6s), 00086/05000 VUs, 915490 complete and 0 interrupted iterations
ceiling_idem   [  69% ] 00086/05000 VUs  2m20.6s/3m25s  15000.15 iters/s

running (2m21.6s), 00032/05000 VUs, 930531 complete and 0 interrupted iterations
ceiling_idem   [  69% ] 00032/05000 VUs  2m21.6s/3m25s  14999.93 iters/s

running (2m22.6s), 00004/05000 VUs, 945571 complete and 0 interrupted iterations
ceiling_idem   [  70% ] 00004/05000 VUs  2m22.6s/3m25s  14999.93 iters/s

running (2m23.6s), 00006/05000 VUs, 960572 complete and 0 interrupted iterations
ceiling_idem   [  70% ] 00006/05000 VUs  2m23.6s/3m25s  14999.93 iters/s

running (2m24.6s), 00017/05000 VUs, 975559 complete and 0 interrupted iterations
ceiling_idem   [  71% ] 00017/05000 VUs  2m24.6s/3m25s  15000.15 iters/s

running (2m25.6s), 00009/05000 VUs, 990566 complete and 0 interrupted iterations
ceiling_idem   [  71% ] 00009/05000 VUs  2m25.6s/3m25s  14999.93 iters/s

running (2m26.6s), 00016/05000 VUs, 1005566 complete and 0 interrupted iterations
ceiling_idem   [  71% ] 00016/05000 VUs  2m26.6s/3m25s  15000.15 iters/s

running (2m27.6s), 00010/05000 VUs, 1020563 complete and 0 interrupted iterations
ceiling_idem   [  72% ] 00010/05000 VUs  2m27.6s/3m25s  15000.15 iters/s

running (2m28.6s), 00016/05000 VUs, 1035558 complete and 0 interrupted iterations
ceiling_idem   [  72% ] 00016/05000 VUs  2m28.6s/3m25s  14999.93 iters/s

running (2m29.6s), 00026/05000 VUs, 1050553 complete and 0 interrupted iterations
ceiling_idem   [  73% ] 00026/05000 VUs  2m29.6s/3m25s  15000.15 iters/s

running (2m30.6s), 00007/05000 VUs, 1065569 complete and 0 interrupted iterations
ceiling_idem   [  73% ] 00007/05000 VUs  2m30.6s/3m25s  15000.15 iters/s

running (2m31.6s), 00006/05000 VUs, 1080570 complete and 0 interrupted iterations
ceiling_idem   [  74% ] 00006/05000 VUs  2m31.6s/3m25s  15000.15 iters/s

running (2m32.6s), 00006/05000 VUs, 1095557 complete and 0 interrupted iterations
ceiling_idem   [  74% ] 00006/05000 VUs  2m32.6s/3m25s  14999.93 iters/s

running (2m33.6s), 00015/05000 VUs, 1110556 complete and 0 interrupted iterations
ceiling_idem   [  75% ] 00015/05000 VUs  2m33.6s/3m25s  14999.93 iters/s

running (2m34.6s), 00008/05000 VUs, 1125569 complete and 0 interrupted iterations
ceiling_idem   [  75% ] 00008/05000 VUs  2m34.6s/3m25s  14999.93 iters/s

running (2m35.6s), 00008/05000 VUs, 1140566 complete and 0 interrupted iterations
ceiling_idem   [  76% ] 00008/05000 VUs  2m35.6s/3m25s  14999.93 iters/s

running (2m36.6s), 00020/05000 VUs, 1155554 complete and 0 interrupted iterations
ceiling_idem   [  76% ] 00020/05000 VUs  2m36.6s/3m25s  14999.93 iters/s

running (2m37.6s), 00000/05000 VUs, 1170569 complete and 0 interrupted iterations
ceiling_idem   [  77% ] 00000/05000 VUs  2m37.6s/3m25s  14999.93 iters/s

running (2m38.6s), 00009/05000 VUs, 1185566 complete and 0 interrupted iterations
ceiling_idem   [  77% ] 00009/05000 VUs  2m38.6s/3m25s  14999.93 iters/s

running (2m39.6s), 00084/05000 VUs, 1200737 complete and 0 interrupted iterations
ceiling_idem   [  78% ] 00084/05000 VUs  2m39.6s/3m25s  15000.15 iters/s

running (2m40.6s), 00027/05000 VUs, 1215624 complete and 0 interrupted iterations
ceiling_idem   [  78% ] 00027/05000 VUs  2m40.6s/3m25s  15269.27 iters/s

running (2m41.6s), 00015/05000 VUs, 1231151 complete and 0 interrupted iterations
ceiling_idem   [  79% ] 00015/05000 VUs  2m41.6s/3m25s  15769.14 iters/s

running (2m42.6s), 00011/05000 VUs, 1247184 complete and 0 interrupted iterations
ceiling_idem   [  79% ] 00011/05000 VUs  2m42.6s/3m25s  16269.69 iters/s

running (2m43.6s), 00007/05000 VUs, 1263697 complete and 0 interrupted iterations
ceiling_idem   [  80% ] 00007/05000 VUs  2m43.6s/3m25s  16769.24 iters/s

running (2m44.6s), 00083/05000 VUs, 1280639 complete and 0 interrupted iterations
ceiling_idem   [  80% ] 00083/05000 VUs  2m44.6s/3m25s  17269.07 iters/s

running (2m45.6s), 00011/05000 VUs, 1298229 complete and 0 interrupted iterations
ceiling_idem   [  81% ] 00011/05000 VUs  2m45.6s/3m25s  17768.93 iters/s

running (2m46.6s), 00020/05000 VUs, 1316255 complete and 0 interrupted iterations
ceiling_idem   [  81% ] 00021/05000 VUs  2m46.6s/3m25s  18269.85 iters/s

running (2m47.6s), 00030/05000 VUs, 1334740 complete and 0 interrupted iterations
ceiling_idem   [  82% ] 00030/05000 VUs  2m47.6s/3m25s  18768.77 iters/s

running (2m48.6s), 00012/05000 VUs, 1353788 complete and 0 interrupted iterations
ceiling_idem   [  82% ] 00012/05000 VUs  2m48.6s/3m25s  19269.31 iters/s

running (2m49.6s), 00556/05000 VUs, 1372769 complete and 0 interrupted iterations
ceiling_idem   [  83% ] 00556/05000 VUs  2m49.6s/3m25s  19769.49 iters/s

running (2m50.6s), 05182/05183 VUs, 1385012 complete and 0 interrupted iterations
ceiling_idem   [  83% ] 05182/05183 VUs  2m50.6s/3m25s  20000.00 iters/s

running (2m51.6s), 00014/05293 VUs, 1408477 complete and 0 interrupted iterations
ceiling_idem   [  84% ] 00014/05293 VUs  2m51.6s/3m25s  20000.00 iters/s

running (2m52.6s), 01456/05293 VUs, 1427104 complete and 0 interrupted iterations
ceiling_idem   [  84% ] 01456/05293 VUs  2m52.6s/3m25s  20000.00 iters/s

running (2m53.6s), 00475/05293 VUs, 1448727 complete and 0 interrupted iterations
ceiling_idem   [  85% ] 00475/05293 VUs  2m53.6s/3m25s  20000.00 iters/s

running (2m54.6s), 00101/05293 VUs, 1468369 complete and 0 interrupted iterations
ceiling_idem   [  85% ] 00101/05293 VUs  2m54.6s/3m25s  20000.00 iters/s

running (2m55.6s), 00015/05293 VUs, 1488488 complete and 0 interrupted iterations
ceiling_idem   [  86% ] 00014/05293 VUs  2m55.6s/3m25s  20000.00 iters/s

running (2m56.6s), 00014/05293 VUs, 1508479 complete and 0 interrupted iterations
ceiling_idem   [  86% ] 00014/05293 VUs  2m56.6s/3m25s  20000.00 iters/s

running (2m57.6s), 00011/05293 VUs, 1528466 complete and 0 interrupted iterations
ceiling_idem   [  87% ] 00011/05293 VUs  2m57.6s/3m25s  20000.00 iters/s

running (2m58.6s), 00013/05293 VUs, 1548479 complete and 0 interrupted iterations
ceiling_idem   [  87% ] 00013/05293 VUs  2m58.6s/3m25s  20000.00 iters/s

running (2m59.6s), 00010/05293 VUs, 1568491 complete and 0 interrupted iterations
ceiling_idem   [  88% ] 00010/05293 VUs  2m59.6s/3m25s  20000.00 iters/s

running (3m00.6s), 00029/05293 VUs, 1588446 complete and 0 interrupted iterations
ceiling_idem   [  88% ] 00029/05293 VUs  3m00.6s/3m25s  20000.00 iters/s

running (3m01.6s), 00029/05293 VUs, 1608466 complete and 0 interrupted iterations
ceiling_idem   [  89% ] 00030/05293 VUs  3m01.6s/3m25s  20000.00 iters/s

running (3m02.6s), 00068/05293 VUs, 1628433 complete and 0 interrupted iterations
ceiling_idem   [  89% ] 00068/05293 VUs  3m02.6s/3m25s  20000.00 iters/s

running (3m03.6s), 00010/05293 VUs, 1648490 complete and 0 interrupted iterations
ceiling_idem   [  90% ] 00010/05293 VUs  3m03.6s/3m25s  20000.00 iters/s

running (3m04.6s), 00022/05293 VUs, 1668470 complete and 0 interrupted iterations
ceiling_idem   [  90% ] 00022/05293 VUs  3m04.6s/3m25s  20000.00 iters/s

running (3m05.6s), 00012/05293 VUs, 1688480 complete and 0 interrupted iterations
ceiling_idem   [  91% ] 00012/05293 VUs  3m05.6s/3m25s  20000.00 iters/s

running (3m06.6s), 00002/05293 VUs, 1708445 complete and 0 interrupted iterations
ceiling_idem   [  91% ] 00003/05293 VUs  3m06.6s/3m25s  20000.00 iters/s

running (3m07.6s), 00024/05293 VUs, 1728464 complete and 0 interrupted iterations
ceiling_idem   [  91% ] 00024/05293 VUs  3m07.6s/3m25s  20000.00 iters/s

running (3m08.6s), 00015/05293 VUs, 1748475 complete and 0 interrupted iterations
ceiling_idem   [  92% ] 00014/05293 VUs  3m08.6s/3m25s  20000.00 iters/s

running (3m09.6s), 00019/05293 VUs, 1768473 complete and 0 interrupted iterations
ceiling_idem   [  92% ] 00019/05293 VUs  3m09.6s/3m25s  20000.00 iters/s

running (3m10.6s), 00036/05293 VUs, 1788457 complete and 0 interrupted iterations
ceiling_idem   [  93% ] 00036/05293 VUs  3m10.6s/3m25s  20000.00 iters/s

running (3m11.6s), 00014/05293 VUs, 1808478 complete and 0 interrupted iterations
ceiling_idem   [  93% ] 00014/05293 VUs  3m11.6s/3m25s  20000.00 iters/s

running (3m12.6s), 02116/05293 VUs, 1826365 complete and 0 interrupted iterations
ceiling_idem   [  94% ] 02116/05293 VUs  3m12.6s/3m25s  20000.00 iters/s

running (3m13.6s), 00366/05293 VUs, 1847752 complete and 0 interrupted iterations
ceiling_idem   [  94% ] 00366/05293 VUs  3m13.6s/3m25s  20000.00 iters/s

running (3m14.6s), 00022/05293 VUs, 1868467 complete and 0 interrupted iterations
ceiling_idem   [  95% ] 00022/05293 VUs  3m14.6s/3m25s  20000.00 iters/s

running (3m15.6s), 00168/05293 VUs, 1888324 complete and 0 interrupted iterations
ceiling_idem   [  95% ] 00168/05293 VUs  3m15.6s/3m25s  20000.00 iters/s

running (3m16.6s), 00225/05293 VUs, 1908267 complete and 0 interrupted iterations
ceiling_idem   [  96% ] 00225/05293 VUs  3m16.6s/3m25s  20000.00 iters/s

running (3m17.6s), 00178/05293 VUs, 1927624 complete and 0 interrupted iterations
ceiling_idem   [  96% ] 00178/05293 VUs  3m17.6s/3m25s  20000.00 iters/s

running (3m18.6s), 05715/05763 VUs, 1937718 complete and 0 interrupted iterations
ceiling_idem   [  97% ] 05714/05763 VUs  3m18.6s/3m25s  20000.00 iters/s

running (3m19.6s), 06626/06642 VUs, 1947764 complete and 0 interrupted iterations
ceiling_idem   [  97% ] 06626/06642 VUs  3m19.6s/3m25s  20000.00 iters/s

running (3m20.6s), 07285/07309 VUs, 1960727 complete and 0 interrupted iterations
ceiling_idem   [  98% ] 07285/07309 VUs  3m20.6s/3m25s  17846.94 iters/s

running (3m21.6s), 07280/07643 VUs, 1972983 complete and 0 interrupted iterations
ceiling_idem   [  98% ] 07280/07643 VUs  3m21.6s/3m25s  13852.33 iters/s

running (3m22.6s), 06688/07643 VUs, 1985440 complete and 0 interrupted iterations
ceiling_idem   [  99% ] 06688/07643 VUs  3m22.6s/3m25s  09847.07 iters/s

running (3m23.6s), 00000/07643 VUs, 1999975 complete and 0 interrupted iterations
ceiling_idem   [  99% ] 00000/07643 VUs  3m23.6s/3m25s  05847.03 iters/s

running (3m24.6s), 00001/07643 VUs, 2003821 complete and 0 interrupted iterations
ceiling_idem   [ 100% ] 00000/07643 VUs  3m24.6s/3m25s  01847.16 iters/s


  █ TOTAL RESULTS 

    CUSTOM
    flash_accepted_bookings........: 662712  3232.511595/s
    flash_booking_latency_ms.......: avg=23.917372 min=-1       med=1        max=778      p(90)=12       p(95)=106     
    flash_failure_responses........: 1341534 6543.602968/s

    HTTP
    http_req_duration..............: avg=23.85ms   min=8.7µs    med=423.83µs max=777.89ms p(90)=11.93ms  p(95)=105.61ms
      { expected_response:true }...: avg=640.78µs  min=8.7µs    med=314.75µs max=104.91ms p(90)=605.24µs p(95)=1.04ms  
    http_req_failed................: 66.93%  1341534 out of 2004247
    http_reqs......................: 2004247 9776.119441/s

    EXECUTION
    dropped_iterations.............: 28251   137.799957/s
    iteration_duration.............: avg=23.92ms   min=100.75µs med=460.91µs max=777.92ms p(90)=12.17ms  p(95)=106.04ms
    iterations.....................: 2004246 9776.114563/s
    vus............................: 2       min=0                  max=7291
    vus_max........................: 7643    min=5000               max=7643

    NETWORK
    data_received..................: 666 MB  3.2 MB/s
    data_sent......................: 535 MB  2.6 MB/s



running (3m25.0s), 00000/07643 VUs, 2004246 complete and 0 interrupted iterations
ceiling_idem ✓ [ 100% ] 00000/07643 VUs  3m25s  00140.71 iters/s